<?php

return [

    //////////////////////////////////////Start Of The Language Index Page////////////////////////////////////
    'language'      =>  'اللغات' ,
    'name'          =>  'إسم اللغه' ,
    'abbr'          =>  'إختصار اللغه' ,
    'action'        =>  'الأكشن'  ,
    'add'           =>  'إضافه' ,
    'edit'          =>  'تعديل' ,
    'delete'        =>  'حذف' ,


    'confirm_delete_language'   =>  'هل أنت متأكد من حذف اللغه ' ,
    'yes'                       =>  'أوافق' ,
    'no'                        =>  'لا أوافق' ,
    'very_important_note'       =>  'ملاحظه هامه جدااا :-' ,
    'product_deletion_message'  =>  'سيتم حذف جميع الأقسام و المنتجات الموجوده باللغه' ,


    'no_language'   =>   'لم يتم تسجيل أى لغه حتى الأن' ,
    'add_language'  =>  'إضافه لغه جديده' ,
    //////////////////////////////////////End Of The Language Index Page////////////////////////////////////




    //////////////////////////////////////Start Form For Adding A New Language////////////////////////////////////
    'please_wait'            =>  'برجاء الإنتظار' ,
    'fail_add_language'      =>  'هناك خطأ ما. الرجاء إعاده المحاولة في وقت لاحق' ,
    'success_add_language'   =>  'تم إضافه اللغه بنجاح' ,
    //////////////////////////////////////End Form For Adding A New Language////////////////////////////////////


    //////////////////////////////////////Start Of The Form To Modify A New Language////////////////////////////////////
    'success_edit_language'  =>  'تم تعديل اللغه بنجاح' ,
    //////////////////////////////////////End Of The Form To Modify A New Language////////////////////////////////////


    ////////////////////////////////////Error Starting To Add A New Language////////////////////////////////////

    'name_required'     =>  'من فضلك قم بإدخال إسم اللغه' ,
    'name_min'          =>  'للأسف إسم اللغه صغير جدا' ,
    'name_max'          =>  'يجب ألا يزيد عدد حروف إسم اللغه عن 15 حرف' ,
    'name_unique'       =>  'هذه اللغه موجوده فعلا' ,

    'abbr_required'     =>  'من فضلك قم بإدخال إختصار اللغه' ,
    'abbr_min'          =>  'للأسف إختصار اللغه صغير جدا' ,
    'abbr_max'          =>  'يجب ألا يزيد عدد حروف إسم اللغه عن 5 حروف' ,
    'abbr_unique'       =>  'تم إضافه هذا الاختصار من قبل' ,

    ////////////////////////////////////Error End To Add A New Language////////////////////////////////////

];
